
%%建立世界坐标系  小车摄像头位于世界坐标原点上方（调整好角度，镜头在正上方）
%%小车车头方向为y正轴，小车车体
%% 左侧为x轴负向，右侧为正向建立世界坐标系，在坐标系一个矩形，定点放在整数点位置
%%我这里世界坐标取点（-15,20），（-15，40），（15,20），（15,40）
%%然后用上位机拍照截图，在matlab中读图数据游标标读处矩形在图像中的坐标u，v
%%将这四个一一对应的点带入下方u，v,x,y(注意数据位置的一一对应)
clear,clc
u=[31,53,147,124]%带入拍照的矩形坐标u横向
v=[72,43,71,43]%带入拍照的矩形坐标v纵向
x=[-15,-15,15,15]%带入矩形世界坐标x
y=[20,40,20,40]%带入矩形世界坐标y
a=-u.*x%%这里看不懂  看看我文件带的文本文档  四组点对应4个方程
b=-v.*x
c=-u.*y
d=-v.*y
A=[u(1),v(1),1,0,0,0,a(1),b(1);0,0,0,u(1),v(1),1,c(1),d(1);
  
u(2),v(2),1,0,0,0,a(2),b(2);0,0,0,u(2),v(2),1,c(2),d(2);
  
u(3),v(3),1,0,0,0,a(3),b(3);0,0,0,u(3),v(3),1,c(3),d(3);
  
u(4),v(4),1,0,0,0,a(4),b(4);0,0,0,u(4),v(4),1,c(4),d(4)
 ]
%此处中为B=[x1,y1,x2,y2,x3,y3,x4,y4]
 B=[-15,20,-15,40,15,20,15,40]'  %更改为矩形世界坐标的x，y              
W=A\B%w即为所求逆透视矩阵的参数m1  m2  m3  m4  m5  m6  m7 m8 最后第三行第三列写1
%下面C是我当时算的W的数据写成的矩阵形式C=[m1  m2  m3 ; m4  m5  m6 ; m7 m8 1]
%C即为图像到世界坐标的透视矩阵
C=[6.0861 -0.2428 -530.5047;-0.1742 -3.6928 750.3649; -0.0044 0.3207 1]
D=inv(C)%求透视矩阵   即c取逆  D为世界坐标到图像坐标的变换矩阵


